In [1]:
import pandas as pd
import numpy as np

In [2]:
r = np.arange(0, 2, 0.2)

In [3]:
ser = pd.Series(r)

In [4]:
ser.sum()

9.000000000000002

In [5]:
ser.mean()

0.9000000000000001

In [6]:
ser.describe()

count    10.00000
mean      0.90000
std       0.60553
min       0.00000
25%       0.45000
50%       0.90000
75%       1.35000
max       1.80000
dtype: float64

In [7]:
df1 = pd.DataFrame({'A': ser[:4]+1, 'B': ser[4:]+2}).fillna({'A':1,'B':2})

In [8]:
df1

     A    B
0  1.0  2.0
1  1.2  2.0
2  1.4  2.0
3  1.6  2.0
4  1.0  2.8
5  1.0  3.0
6  1.0  3.2
7  1.0  3.4
8  1.0  3.6
9  1.0  3.8

In [9]:
df1.mean()

A    1.12
B    2.78
dtype: float64

In [10]:
df1.mean(axis='columns')

0    1.5
1    1.6
2    1.7
3    1.8
4    1.9
5    2.0
6    2.1
7    2.2
8    2.3
9    2.4
dtype: float64

In [11]:
df1.describe()

               A          B
count  10.000000  10.000000
mean    1.120000   2.780000
std     0.214994   0.726942
min     1.000000   2.000000
25%     1.000000   2.000000
50%     1.000000   2.900000
75%     1.150000   3.350000
max     1.600000   3.800000

In [12]:
df2 = pd.DataFrame({'étudiant': ['A', 'B', 'C', 'A', 'B', 'C'], 'notes': np.random.randint(12,18,6)}, columns=['étudiant', 'notes'])

In [13]:
df2

  étudiant  notes
0        A     14
1        B     12
2        C     15
3        A     13
4        B     17
5        C     13

In [14]:
df2.groupby('étudiant').sum()

          notes
étudiant
A            27
B            29
C            28

In [15]:
df2.groupby('étudiant').describe()

         notes
         count  mean       std   min    25%   50%    75%   max
étudiant
A          2.0  13.5  0.707107  13.0  13.25  13.5  13.75  14.0
B          2.0  14.5  3.535534  12.0  13.25  14.5  15.75  17.0
C          2.0  14.0  1.414214  13.0  13.50  14.0  14.50  15.0

In [18]:
def fonction_filtre(v): return v['notes'].median() > 14

In [19]:
df2.groupby('étudiant').filter(fonction_filtre)

  étudiant  notes
1        B     12
4        B     17

In [20]:
moyennes = df2.groupby('étudiant').mean().add_prefix('moyenne_')

In [21]:
moyennes

          moyenne_notes
étudiant
A                  13.5
B                  14.5
C                  14.0